# BRW Estimation

Replication code of the BRW shock by Bu, Wu, and Rogers (2021).

In [9]:
import pandas as pd

maturity = 2
year = 2020
month = 12
monthname = "Dec"
MAR2020 = 0

## 1. Calculating the difference of the 2-year Treasury series (DGS2)

Load the data and rename columns

In [8]:
data = pd.read_excel(r"C:\Users\Alysson\Documents\GitHub\Monetary-Shocks\DGS2.xls")
data.rename(columns={"observation_date": "date"}, inplace=True)
data.head()

        date  DGS2
0 1994-01-03  4.30
1 1994-01-04  4.29
2 1994-01-05  4.31
3 1994-01-06  4.24
4 1994-01-07  4.09

Convert date to datetime format and create additional date-related columns

In [10]:
data["date"] = pd.to_datetime(data["date"])
data["year"] = data["date"].dt.year
data["month"] = data["date"].dt.month
data["day"] = data["date"].dt.day
data["mdate"] = data["date"].dt.to_period("M")

Filter data for the specified period (up to September 2019 - Cut-off date used for the estimation in the research paper.)

In [17]:
data = data[data["mdate"] <= pd.Period("2019-09")]
data = data[data["mdate"] >= pd.Period("1994-01")]

Calculate the difference of the series (dgs_d)

In [18]:
data["dgs_d"] = data["DGS" + str(maturity)] - data["DGS" + str(maturity)].shift(1)
data.head()

        date  DGS2  year  month  day    mdate  dgs_d
0 1994-01-03  4.30  1994      1    3  1994-01    NaN
1 1994-01-04  4.29  1994      1    4  1994-01  -0.01
2 1994-01-05  4.31  1994      1    5  1994-01   0.02
3 1994-01-06  4.24  1994      1    6  1994-01  -0.07
4 1994-01-07  4.09  1994      1    7  1994-01  -0.15

Set "mdate" as the index and convert it to a time series

In [19]:
data.set_index("mdate", inplace=True)
data.index = pd.to_datetime(data.index.to_timestamp())

Drop unnecessary columns

In [20]:
data.drop(columns=["year", "month", "day"], inplace=True)
data.head()

                 date  DGS2  dgs_d
mdate
1994-01-01 1994-01-03  4.30    NaN
1994-01-01 1994-01-04  4.29  -0.01
1994-01-01 1994-01-05  4.31   0.02
1994-01-01 1994-01-06  4.24  -0.07
1994-01-01 1994-01-07  4.09  -0.15

Save the resulting DataFrame to a new file

In [21]:
data.to_pickle("temp.pkl")

## 2. Adding FOMC dates

Load the FOMC dates from the Excel file

In [31]:
fomc_dates = pd.read_excel("C:/Users/Alysson/Documents/GitHub/Monetary-Shocks/FOMCdate.xlsx")
fomc_dates.rename(columns={"date": "FOMC_date"}, inplace=True)
fomc_dates.head()

   FOMC_date  q
0 1936-03-19  1
1 1936-05-25  1
2 1936-11-20  1
3 1937-01-26  1
4 1937-03-15  1

Convert date to datetime format and create additional date-related columns

In [32]:
fomc_dates["FOMC_date"] = pd.to_datetime(fomc_dates["FOMC_date"])
fomc_dates["year"] = fomc_dates["FOMC_date"].dt.year
fomc_dates["month"] = fomc_dates["FOMC_date"].dt.month
fomc_dates["day"] = fomc_dates["FOMC_date"].dt.day
fomc_dates["mdate"] = fomc_dates["FOMC_date"].dt.to_period("M")

MAR2020 = 0

if MAR2020 == 0:
    fomc_dates = fomc_dates[~((fomc_dates["year"] == 2020) & (fomc_dates["month"] == 3) & (fomc_dates["day"] == 15))]

Drop unnecessary columns

In [33]:
fomc_dates.drop(columns=["year", "month", "day"], inplace=True)

Load the previous DataFrame "temp.dta"

In [34]:
temp_data = pd.read_pickle("temp.pkl")

Merge the two DataFrames on the 'date' column

In [35]:
merged_data = pd.merge(temp_data, fomc_dates, how="inner", left_on="date", right_on="FOMC_date")

Drop rows where 'q' is missing (denoted as NaN)

In [36]:
merged_data = merged_data.dropna(subset=["q"])

Replace missing values (NaN) in 'q' with 0

In [42]:
merged_data["q"].fillna(0, inplace=True)
merged_data.head()

        date  DGS2  dgs_d  FOMC_date  q    mdate
0 1994-02-04  4.42   0.14 1994-02-04  1  1994-02
1 1994-02-11  4.44  -0.01 1994-02-11  0  1994-02
2 1994-03-22  5.03  -0.06 1994-03-22  1  1994-03
3 1994-03-29  5.19   0.07 1994-03-29  0  1994-03
4 1994-05-17  5.88  -0.15 1994-05-17  1  1994-05

Save the merged DataFrame to a new file

In [40]:
merged_data.to_pickle("temp.pkl")

## 3. Estimation

Load the data from "feds200628.csv"

In [82]:
yield_data = pd.read_csv(r"C:\Users\Alysson\Documents\GitHub\Monetary-Shocks\feds200628.csv")

Convert 'date' column to datetime format and keeping only necessary columns

In [83]:
yield_data['date'] = pd.to_datetime(yield_data['Date'], format='%Y-%m-%d')

In [84]:
yield_data['year'] = yield_data['date'].dt.year
yield_data['month'] = yield_data['date'].dt.month
yield_data['day'] = yield_data['date'].dt.day
yield_data['date'] = pd.to_datetime(yield_data[['year', 'month', 'day']])
yield_data['mdate'] = yield_data['date'].dt.to_period('M')
yield_data = yield_data[['date', 'mdate'] + [col for col in yield_data.columns if col.startswith('SVENY')]]
yield_data = yield_data[yield_data['mdate'] >= pd.Period('1994-01')]
yield_data.head()

,date,mdate,SVENY01,SVENY02,SVENY03,SVENY04,SVENY05,SVENY06,SVENY07,SVENY08,...,SVENY21,SVENY22,SVENY23,SVENY24,SVENY25,SVENY26,SVENY27,SVENY28,SVENY29,SVENY30
8493,1994-01-03,1994-01,3.731411,4.260040,4.682096,5.024778,5.306916,5.541907,5.739533,5.907118,...,6.848436,6.878646,6.906286,6.931662,6.955033,6.976625,6.996629,7.015213,7.032521,7.048678
8494,1994-01-04,1994-01,3.713510,4.239907,4.656361,4.992733,5.269173,5.499619,5.693969,5.859453,...,6.810627,6.841833,6.870407,6.896656,6.920843,6.943197,6.963913,6.983162,7.001092,7.017833
8495,1994-01-05,1994-01,3.705392,4.248564,4.671605,5.010070,5.286970,5.517565,5.712289,5.878515,...,6.846719,6.878791,6.908162,6.935146,6.960013,6.982997,7.004297,7.024090,7.042527,7.059742
8496,1994-01-06,1994-01,3.668817,4.193361,4.607845,4.943227,5.219876,5.451570,5.647936,5.815925,...,6.794964,6.827326,6.856961,6.884186,6.909274,6.932459,6.953947,6.973913,6.992512,7.009876
8497,1994-01-07,1994-01,3.571147,4.060404,4.454530,4.779420,5.051982,5.283647,5.482460,5.654320,...,6.682563,6.717051,6.748641,6.777669,6.804423,6.829152,6.852073,6.873372,6.893213,6.911738

Create a list for all maturities of the treasuries

In [85]:
list_maturities = [f"{num:02}" for num in range(1, 31)]
print(list_maturities)

['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30']

Calculate differences for each maturity

Create aligned_dgs_d column